<h3>Create & Access SQLite database using Python </h3>

#### Create db using sqlite3

In [5]:
import sqlite3

In [6]:
# cursor_obj.close()
# conn.close()
conn = sqlite3.connect('INSTRUCTOR.DB')

In [7]:
cursor_obj = conn.cursor()

#### Create a table in the database

In [8]:
cursor_obj.execute("DROP TABLE IF EXISTS INSTRUCOR")

In [9]:
table = """ CREATE TABLE IF NOT EXISTS INSTRUCTOR(ID INTEGER PRIMARY KEY NOT NULL,FNAME VARCHAR(20),LNAME VARCHAR(20),CITY VARCHAR(20),CCODE CHAR(2));"""
cursor_obj.execute(table)

In [10]:
cursor_obj.execute("""INSERT INTO INSTRUCTOR VALUES (1,'Pavan','Raj','Bangalore',"IN")""")

In [11]:
cursor_obj.execute(""" INSERT INTO INSTRUCTOR VALUES(2,"MOHAN","KUMAR","MAGADI","IN")""")

In [12]:
cursor_obj.execute(""" INSERT INTO INSTRUCTOR VALUES(3,"YOGESH","K","HESHRAGATTA","IN"),(4,"SANYUKTA","DAS","WEST BENGAL","IN")""")

#### Query data in the table

In [13]:
statement = "select * from INSTRUCTOR"
cursor_obj.execute(statement)

print("all the data")
output = cursor_obj.fetchall()
for row in output:
    print(row)

all the data
(1, 'Pavan', 'Raj', 'Bangalore', 'IN')
(2, 'MOHAN', 'KUMAR', 'MAGADI', 'IN')
(3, 'YOGESH', 'K', 'HESHRAGATTA', 'IN')
(4, 'SANYUKTA', 'DAS', 'WEST BENGAL', 'IN')

In [14]:
output

[(1, 'Pavan', 'Raj', 'Bangalore', 'IN'),
 (2, 'MOHAN', 'KUMAR', 'MAGADI', 'IN'),
 (3, 'YOGESH', 'K', 'HESHRAGATTA', 'IN'),
 (4, 'SANYUKTA', 'DAS', 'WEST BENGAL', 'IN')]

In [15]:
## fetch few rows from the table

statement = "select * from instructor"
cursor_obj.execute(statement)
for row in cursor_obj.fetchmany(2):
    print(row)

(1, 'Pavan', 'Raj', 'Bangalore', 'IN')
(2, 'MOHAN', 'KUMAR', 'MAGADI', 'IN')

In [16]:
# Fetch only FNAME from the table
statement = "select fname from instructor"
cursor_obj.execute(statement)
for row in cursor_obj.fetchall():
    print(row)

('Pavan',)
('MOHAN',)
('YOGESH',)
('SANYUKTA',)

In [17]:
conn.commit()

In [18]:
statement = """update instructor set city = 'BANGALORE' WHERE FNAME = 'SANYUKTA'"""
cursor_obj.execute(statement)
output  = cursor_obj.execute("select * from instructor")
for row in output:
    print(row)

(1, 'Pavan', 'Raj', 'Bangalore', 'IN')
(2, 'MOHAN', 'KUMAR', 'MAGADI', 'IN')
(3, 'YOGESH', 'K', 'HESHRAGATTA', 'IN')
(4, 'SANYUKTA', 'DAS', 'BANGALORE', 'IN')

#### Retrieve data into Pandas

In [19]:
import pandas as pd

df = pd.read_sql_query('SELECT * FROM INSTRUCTOR',conn)
df

   ID     FNAME  LNAME         CITY CCODE
0   1     Pavan    Raj    Bangalore    IN
1   2     MOHAN  KUMAR       MAGADI    IN
2   3    YOGESH      K  HESHRAGATTA    IN
3   4  SANYUKTA    DAS    BANGALORE    IN

In [21]:
df['CITY']

0      Bangalore
1         MAGADI
2    HESHRAGATTA
3      BANGALORE
Name: CITY, dtype: object

In [22]:
df.shape

(4, 5)

####  Close the Connection

In [23]:
conn.close()